export const agreementTermsText = `제1장 총칙
제 1 조 목적
이 약관은 컴뷰어스 에서 운영하는 ComViewers.com 인터넷사이트(이하 "컴뷰어스") 회원 약관에 동의 한 모든 회원 및 비회원들을 대상으로 하며, 컴뷰어스가 운영하는 인터넷 관련 서비스(이하 "서비스"라 한다)를 이용함에 있어, 컴뷰어스와 컴뷰어스 인터넷 사이트에 가입한 회원의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.

제 2조 약관의 효력과 변경
이 약관은 컴뷰어스가 온라인 서비스 화면을 통해 내용을 게시하고 이용자가 이에 '동의'한다는 의사표시를 함으로써 효력을 발생합니다.
컴뷰어스는 사정 변경의 경우와 영업상 주요 사유가 있을 때 관계법률 및 법령하에 약관을 개정할 수 있습니다. 변경된 약관은 서비스 화면에 게시되거나 기타의 방법으로 회원에게 공지됨으로써 효력이 발생됩니다.
회원은 변경된 약관에 동의하지 않을 경우, 서비스 이용을 중단하고 탈퇴할 수 있습니다.
약관이 변경된 이후에도 변경된 약관에 이의제기를 하지 않고 계속적으로 서비스를 이용하는 경우에는 회원이 약관의 변경사항에 동의한 것으로 봅니다.
제 3 조 약관 외 준칙
이 약관에 명시되지 않은 사항이 국내 관계법령에 규정되어 있을 경우에는 관련 법령 규정 및 해석에 따릅니다.

제 2 장 회원가입과 서비스 이용
제 1 조 회원가입 및 이용계약의 성립
이용자는 컴뷰어스가 정한 가입 양식에 따라 회원정보를 성실히 기입하고, 약관에 동의한다는 의사표시를 함으로써 회원가입을 신청하며 컴뷰어스는 컴뷰어스가 정한 절차를 거쳐 회원가입을 승낙하며 회원 가입에 따르는 별도의 비용은 없으며 무료로 가입됩니다.
회원에 가입하여 서비스를 이용하고자 하는 희망자는 컴뷰어스가 정한 소정의 양식에 따른 개인 신상정보를 제공해야 하며, 현재의 사실과 일치하는 완전한 정보를 제공하셔야 합니다. 회원이 제공하는 정보의 내용이 허위(차명, 비실명 등)인 것으로 판명되거나, 그러하다고 의심할 만한 합리적인 사유가 발생할 경우 컴뷰어스는 회원의 본 서비스 사용을 일부 또는 전부 중지할 수 있으며, 이로 인해 발생하는 불이익에 대해 책임을 지지 않습니다.
제 2 조 회원정보의 변경
회원은 이용 신청 시 기재한 회원정보가 변경되었을 경우 온라인으로 직접 수정해야 하며, 관리자에게 수정을 요구할 수 있습니다. 이때 변경하지 않은 정보로 인해 발생되는 문제는 회원에게 책임이 있습니다.

제 3 조 이용신청의 승낙
컴뷰어스는 회원이 모든 사항을 정확히 기재하여 신청할 경우 서비스 이용을 승낙합니다. 단, 제4조의 '이용신청의 제한'에 해당하는 경우 이를 승낙하지 아니 합니다.

제 4 조 이용신청의 제한
다른 사람의 명의를 사용하여 신청하였을 때
본인의 주민등록번호를 사용하지 아니 하였을 때
이용 계약 신청서의 내용을 허위로 기재하였을 때
사회의 안녕 질서 혹은 미풍양속을 저해할 목적으로 신청하였을 때
기타 컴뷰어스가 정한 이용 신청 요건이 미비 되었을 때
제 5 조 서비스의 제공 및 이용
서비스 이용은 컴뷰어스의 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴, 1일 24시간을 원칙으로 합니다. 다만, 운영상의 이유로 컴뷰어스가 정한 기간에 서비스가 일시 중지될 수 있습니다. 이런 경우 컴뷰어스는 사전 또는 사후 이를 공지합니다.
컴뷰어스는 다음 각 호에 해당하는 경우 서비스 제공을 중지할 수 있습니다.
서비스용 설비의 보수 등 공사로 인한 부득이한 경우
전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지했을 경우
설비 장애 또는 이용 폭주 등으로 서비스 이용에 지장이 있는 경우
기타 불가항력적 사유가 있는 경우
제 6 조 이용자에 대한 통지
컴뷰어스는 회원이 서비스 이용 중 필요하다고 인정되는 다양한 정보에 대해서 전자메일이나 무선메일, 기타 방법 등으로 회원에게 정보를 제공할 수 있습니다.
컴뷰어스는 불특정다수 회원에 대한 통지의 경우 1주일 이상 게시판에 게시함으로써 개별 통지에 갈음할 수 있습니다.
제 7 조 이용자의 개인정보, ID 및 비밀번호에 대한 의무
회원은 서비스 이용을 위해 등록할 경우 현재의 사실과 일치하는 정보를 제공하셔야 합니다. 또한 등록한 정보에 변경이 발생할 경우 즉시 갱신하셔야 합니다. 회원이 제공하는 정보의 내용이 허위(차명, 비실명 등)인 것으로 판명되거나, 그러하다고 의심할 만한 합리적인 사유가 발생할 경우 컴뷰어스는 회원의 본 서비스 사용을 일부 또는 전부 중지할 수 있으며, 이로 인해 발생하는 불이익에 대해 책임을 지지 않습니다.
컴뷰어스는 컴뷰어스와 제휴를 맺은 사이트와 컴뷰어스의 사이트를 편리하게 이용할 수 있도록 하기 위해 회원의 정보를 제휴 사이트들과 공유할 수 있으며, 공유를 위해 컴뷰어스는 회원의 컴퓨터에 쿠키를 전송할 수 있습니다.
회원이 불법으로 타인의 개인정보를 게시, 전송, 입수하였거나 전자메일 기타 다른 수단에 의하여 게시, 전송 또는 입수한 모든 형태의 정보에 대하여는 회원이 모든 책임을 부담하며 컴뷰어스는 어떠한 책임도 부담하지 아니합니다.
컴뷰어스가 관계법령 및 "개인정보보호정책"에 의해서 그 책임을 지는 경우를 제외하고, 자신의 ID와 비밀번호에 관한 관리책임은 각 이용자에게 있습니다.
이용자는 자신의 ID 및 비밀번호를 제3자에게 이용하게 해서는 안됩니다.
이용자는 자신의 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 컴뷰어스에 통보하고 컴뷰어스의 안내가 있는 경우에는 그에 따라야 합니다.
제 8 조 광고 게재
컴뷰어스는 서비스의 운용과 관련하여 서비스화면, 홈페이지, 전자메일 등에 광고 등을 게재할 수 있습니다.
컴뷰어스는 서비스상에 게재되어 있는 광고주의 판촉활동에 회원이 참여하거나 거래의 결과로서 발생하는 모든 손실 또는 손해에 대해 책임을 지지 않습니다.
제 3 장 계약 해지 및 서비스 이용 제한
제 1 조 계약 해지 및 이용 제한
회원이 서비스 이용 계약을 해지 하고자 할 때는 회원 본인이 직접 회원정보수정 메뉴의 개인정보관리 페이지에서 해지 신청을 해야 합니다.
컴뷰어스는 회원이 다음 사항에 해당하는 행위를 하였을 경우 사전 통지 없이 이용 계약을 해지하거나 또는 기간을 정하여 서비스 이용을 중지할 수 있습니다.
공공 질서 및 미풍 양속에 반하는 경우
국익 또는 사회적 공익을 저해할 목적으로 서비스 이용을 계획 또는 실행할 경우
타인의 ID및 비밀번호를 도용한 경우
타인의 명예를 손상시키거나 불이익을 주는 경우
같은 이용자가 다른 ID로 이중 등록을 한 경우
서비스에 위해를 가하는 등 건전한 이용을 저해하는 경우
기타 관련법령이나 컴뷰어스가 정한 이용조건에 위배되는 경우
제 2 조 이용 제한 절차
컴뷰어스는 이용제한을 하고자 하는 경우에는 그 사유, 일시 및 기간을 정하여 이용자의 전자우편 또는 전화 등의 방법에 의하여 해당 이용자 또는 대리인에게 통지합니다. 다만, 컴뷰어스가 긴급하게 이용을 정지할 필요가 있다고 인정하는 경우에는 그러하지 아니할 수 있습니다.

제 4 장 책 임
제 1 조 컴뷰어스의 의무
컴뷰어스는 특별한 사정이 없는 한 회원이 신청한 서비스를 이용할 수 있도록 합니다.
컴뷰어스는 이 약관에서 정한 바에 따라 계속적, 안정적으로 서비스를 제공할 의무가 있으며 이를 위해 컴뷰어스는 노력해야 하며, 부득이한 이유로 서비스가 중단되면 지체없이 이를 수리 복구합니다. 단, 천재지변, 비상사태, 그 밖의 부득이한 경우에는 그 서비스를 일시 중단하거나 중지할 수 있습니다.
컴뷰어스는 회원으로부터 제기되는 의견이나 불만이 정당하다고 인정될 경우에는 처리하여야 합니다.<
컴뷰어스는 서비스 제공으로 알게 된 회원의 신상정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않습니다. 단, 전기통신기본법 등 법률의 규정에 의해 국가기관이 요구하는 경우, 범죄에 대한 수사상의 목적이 있거나 정보통신윤리 위원회의 요청이 있는 경우, 기타 관계법령에서 정한 절차에 따른 요청이 있는 경우에는 그러하지 않습니다.
제 2 조 회원의 의무
ID와 비밀번호에 관한 모든 관리의 책임은 회원에게 있습니다.
회원은 자신의 아이디를 타인에게 양도, 증여할 수 없습니다.
자신의 ID가 부정하게 사용된 경우, 회원은 반드시 컴뷰어스에 그 사실을 전자우편이나 기타 방법을 이용 통보해야 합니다.
회원은 등록 양식에서 요구되는 내용들에 대해 진실되고 정확하며 현재의 사실과 일치되는 완전한 정보를 제공하고 유지합니다.
회원은 사전 승낙없이 상업적인 목적을 위하여 서비스를 이용할 수 없습니다.
회원은 컴뷰어스를 이용함으로써 얻은 정보를 승낙없이 복제, 송신, 출판, 배포, 방송 및 기타 방법에 의하여 상업적으로 이용하거나 제3자에게 이용하게 할 수 없습니다.
회원은 불법적이거나 타인에게 해를 입히거나, 타인의 명예를 훼손하는 등의 행위를 하지 않습니다.
회원은 타인의 개인정보를 수집 또는 저장하여 유용하지 않습니다.
회원은 이 약관 및 관계법령에서 규정한 사항을 준수하여야 합니다.
제 5 장 개인정보보호
컴뷰어스의 개인정보보호정책은 정보통신망이용촉진및정보보호등에관한법률 제22조 내지 제25조의 규정을 준수합니다. 아래의 내용은 2000년 6월 1일부터 시행되는 '개인정보보호지침'에 따라 작성되었습니다

제1조 컴뷰어스의 보안관리
컴뷰어스는 이용자의 개인정보가 분실, 도난, 누출, 또는 훼손되지 않도록 안전성 확보에 필요한 조치를 강구합니다. 단, 회원이 게시판이나 email, 채팅 등 온라인 상에서 자발적으로 제공함으로써 발생하는 개인정보 유출은 이용자 책임이 있고 컴뷰어스에는 책임이 없습니다.

제2조 컴뷰어스의 회원정보 사용에 대한 동의
컴뷰어스는 컴뷰어스가 제공하는 서비스를 이용하는 이용자를 대상으로 해당 서비스의 양적, 질적 향상을 위하여 이용자의 개인 식별이 가능한 개인정보를 이용자의 동의를 받아 이를 수집하여 맞춤서비스등의 TM마케팅서비스 등에 이용할 수 있습니다.
컴뷰어스가 수집하는 개인정보는 서비스의 제공에 필요한 최소한으로 하되, 필요한 경우 보다 더 자세한 정보를 요구할 수 있습니다.
이용자가 제공한 개인정보는 이용자의 동의없이 제3자에게 누설하거나 제공하지 않습니다.
컴뷰어스는 이용자에게 맞춤서비스, 온라인광고서비스, 쇼핑몰서비스, 커뮤니티서비스, 유료컨텐츠서비스등 다양한 서비스를 제공할 목적으로 여러 분야의 전문 컨텐츠사업자 혹은 비즈니스 사업자와 함께 파트너쉽을 맺어 이용자의 개인정보를 이용할 수 있습니다. 따라서, 컴뷰어스는 이용자가 제휴 및 협력사를 통해 제공되는 서비스를 사용할 수 있도록 하기 위해 회원 가입시 입력받은 개인정보로부터 이름이나 주소와 같은 서비스 이용에 필요한 제한된 범위의 개인정보를 제휴 및 협력사와 공유할 수 있습니다.
동조 제1항 내지 제4항의 개인정보 이용시 이용자의 동의는 본 약관에 동의한 것으로써 갈음할 수 있습니다.
이용자는 컴뷰어스에 제공한 개인정보의 수집과 이용에 대한 동의를 철회할 수 있습니다.
이용자는 컴뷰어스에 제공한 개인정보를 열람할 수 있고 그 정보가 잘못된 경우 컴뷰어스에 대하여 정정을 요구할 수 있습니다.

제 6 장 책임의 면제
제 1 조 면책 사항
컴뷰어스는 약관에 명시된 사유로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공의 불이행에 관한 책임이 면제됩니다.
서비스에 포함된 모든 정보, 소프트웨어, 제품 및 기타 서비스에는 부정확함이나 인쇄상의 오류가 있을 수 있습니다. 그러한 정보에 대한 변경은 정기적으로 이루어집니다. 컴뷰어스 및/또는 서비스 공급자는 언제든지 본 사이트를 개선하거나 변경할 수 있습니다. 개인적, 의료적, 법적 또는 재정적 결정을 함에 있어서 본 서비스를 통하여 받은 조언에 의존하지 마시고, 적절한 전문가와 상의하여 이용자의 상황에 맞는 특별한 조언을 받으셔야 합니다.
컴뷰어스 및/또는 각 서비스 공급자는 어떠한 목적으로든 본 사이트에 있는 정보, 소프트웨어, 제품, 서비스 및 관련 그래픽의 적합성, 신빙성, 시의성 및 정확성에 관한 어떠한 보증도 하지 아니합니다. 그러한 모든 정보, 소프트웨어, 제품, 서비스 및 관련 그래픽은 어떠한 종류의 보증이 없이 "있는 그대로" 제공됩니다.
컴뷰어스 및/또는 각 서비스 공급자는 본 정보, 소프트웨어, 제품, 서비스 및 관련 그래픽에 관한 모든 보증 및 조건을 부인합니다. 그 부인되는 보증 및 조건에는 상업성, 특별용도에 대한 적합성, 권리 및 비침해성에 대한 모든 묵시적인 보증 및 조건이 포함됩니다.
컴뷰어스 및/또는 서비스 공급자는 어떠한 경우에도 직접적, 간접적, 부수적, 또는 결과적 손해, 기타 어떠한 형태의 손해에 대하여도 책임을 지지 아니합니다. 그러한 손해에는 컴뷰어스 사이트의 사용, 컴뷰어스 사이트의 사용 지연 또는 비작동, 서비스의 제공 또는 미제공과 어떤 방식으로든 관련되어 있거나 그로부터 발생하는 사용손실, 데이터 또는 이익에 대한 손해 또는 본 사이트를 통하여 얻은 정보, 소프트웨어, 제품, 서비스 및 관련 그래픽에 대한 손해, 기타 계약, 불법행위 등 어느 형태로든 본 사이트 사용으로부터 발생하는 손해를 포함합니다.
컴뷰어스 또는 그 공급자가 그러한 손해발생 가능성에 대하여 통보를 받은 경우에도 책임을 지지 않습니다. 만일 이용자께서 본 사이트 또는 본 사용조건에 불만이 있는 경우, 본 사이트의 사용 접속을 종료하는 것만이 귀하의 유일한 구제수단입니다.
컴뷰어스는 컴뷰어스의 연결 사이트에 대해 보증책임을 지지 않으며 따라서 연결 사이트와 이용자간에 이루어진 어떠한 거래에 대해서도 책임을 지지 않습니다.
컴뷰어스는 회원의 귀책사유로 인한 서비스 이용 장애에 대해 그 책임이 면제됩니다.
컴뷰어스는 회원이 서비스에 게재한 정보, 자료, 사실의 신뢰도, 정확성 등 그 내용에 관하여 책임이 면제됩니다.

제 7 장 일반 사항
제 1 조
본 약관은 대한민국 관련 법률의 적용을 받습니다. 서비스 이용자는 본 사이트의 사용으로부터 발생하거나 그와 관련된 모든 분쟁이 발생한 경우 컴뷰어스 관할 법원에 전속적 관할권이 있음에 동의합니다. 따라서, 본 약관의 효력을 인정하지 않는 관할 지역내에서는 본 사이트의 사용이 허가되지 아니합니다.

제 2 조
이용자는 컴뷰어스 사이트 이용의 결과로서, 이용자와 컴뷰어스간에 어떠한 합작투자, 파트너쉽, 고용 또는 대리인 관계가 존재하지 않는 것에 동의합니다. 컴뷰어스가 본 계약을 수행함에 있어서는 현존하는 법 및 법적 절차의 적용을 받습니다. 본 계약에 규정된 어떠한 조항에 의하여도 본 서비스 또는 그 사용과 관련하여 컴뷰어스가 수집하거나 제공받은 정보의 사용과 관련한 정부, 법원 및 법률집행 당국의 요청 또는 요구사항을 준수할 컴뷰어스의 권리가 훼손되지 아니합니다.

제 3 조 (지적소유권의 보호)
컴뷰어스가 작성한 저작물에 대한 저작권 및 기타 지적재산권은 모두 컴뷰어스에 귀속합니다. 회원은 서비스를 이용하여 얻은 정보를 가공, 판매하는 행위 등 서비스에 게재된 자료를 상업적으로 이용할 수 없습니다.

제 4 조 (분쟁해결 및 기타사항)
1. 컴뷰어스는 이용자가 제기하는 정당한 의견이나 불만을 반영하여 적절하고 빠른 조치를 취합니다. 컴뷰어스는 신속한 처리가 곤란한 경우, 이용자에게 그 사유와 처리일정을 통보합니다.
2. 회원이 컴뷰어스를 상대로 소송을 제기할 경우, 상충하는 법령 또는 법규에 관계없이 본 서비스 의 이용 또는 약관으로 인하여 발생하는 모든 청구권은 청구권이 발생한 날로부터 1년 이내에 행사되어야 하며, 이후에는 소멸합니다.
제 5 조 (손해배상책임)
컴뷰어스는 컴뷰어스의 서비스가 무상으로 제공되는 한 서비스의 이용과 관련하여 회원에게 발생한 어떠한 손해에 대해서도 책임을 지지 않습니다.

제 6 조 관할 법원
이용자와 컴뷰어스간에 서비스로부터 발생하거나 서비스와 관련된 모든 분쟁은 "컴뷰어스"의 주소지를 관할하는 대한민국내의 법원으로 합니다.

제 7 조
앞서 규정한 책임의 부인을 포함하는 본 계약 일부 조항이 적용법에 의하여 무효이거나 실행할 수 없는 것으로 판단되는 경우, 그 무효이거나 실행할 수 없는 조항은 본래 조항의 취지에 가장 부합하는 것으로 유효하거나 실행가능한 조항으로 대체될 것이며, 계약의 나머지 조항은 계속 유효합니다.

부칙
이 약관은 2019년 06월 30일부터 시행합니다.`

